CSI API ETABS v1
cCaseStaticNonlinear Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cCaseStaticNonlinear
Public Interface cCaseStaticNonlinear
Dim instance As cCaseStaticNonlinear
public interface class cCaseStaticNonlinear
type cCaseStaticNonlinear =  interface end
The cCaseStaticNonlinear type exposes the following members.
Methods
Name | Description
GetGeometricNonlinearity
GetHingeUnloading
GetInitialCase
GetLoadApplication
GetLoads
 Retrieves the load data for the specified load case
GetMassSource
GetModalCase
GetResultsSaved
GetSolControlParameters
GetTargetForceParameters
SetCase
 Initializes a static nonlinear load case.
SetGeometricNonlinearity
 Sets the geometric nonlinearity option for the specified load case.
SetHingeUnloading
SetInitialCase
SetLoadApplication
SetLoads
 Sets the load data for the specified analysis case.
SetMassSource
SetModalCase
SetResultsSaved
SetSolControlParameters
SetTargetForceParameters
Top
See Also
Reference
ETABSv1 Namespace